[
  {
    "path": "posts/2022-06-27-build-personal-webiste/",
    "title": "Building a personal website",
    "description": "Build a personal website with Distill and postcards package and host it on github",
    "author": [
      {
        "name": "Ya-Feng Wen",
        "url": {}
      }
    ],
    "date": "2022-06-27",
    "categories": [],
    "contents": "\r\nThere are several R packages available to build a personal website with ease and aesthetic, including blogdown, postcards and Distill. Once the website is built, it can be easily hosted on the GitHub or Netlify for free. This post will demonstrate how to build a personal website with a personal home page using postcards, blog posts and articles with Distill, and host such website on GitHub. The workflow is largely referenced from two sources: 1) the workshop on “Introduce yourself online” by Alison Hill and 2) “Building websites in RStudio” by Maria Tackett hosted by R-Ladies Baltimore (The github repo for this talk can be found here).\r\nSteps overview\r\nCreate a github repo for personal website\r\nUse Distill to create a Distill blog\r\nRestart project and Build website\r\nUse postcards to create a personal landing page\r\nCreate a personal theme CSS if needed\r\nCreate posts\r\nDeploy the site on GitHub and repeat step 6 and 7\r\nSteps in detail\r\nCreate a github repo for personal website\r\n\r\nThe repo name needs to contain github.io\r\nThe repo name will be the URL for the website (can change later)\r\nEdit “About” section so others (including yourself) know the purpose of this repo easily\r\nClone the repo by copying the HTTPS URL\r\nStart a new RStudio project –> Version Control –> Clone Git Repository –> Paste the Repository URL –> Create Project\r\n\r\nUse Distill to create a Distill blog\r\n\r\n\r\n# install.packages(\"distill\")\r\nlibrary(distill)\r\n\r\n# gh_pages, configure the site for publishing using GitHub Pages\r\ncreate_blog(dir = \".\", title = \"Personal Website\", gh_pages = TRUE) \r\n\r\n\r\n\r\n_site.yml: Website configuration file\r\noutput_dir: “docs”: The docs folder contains all the components for the website which will be used when deploy the website on GitHub.\r\nnavbar: Navigation bar at the top of page\r\ntext: Text displayed in navigation bar\r\nhref: (Relative) link to the page in the docs folder\r\n\r\nindex.Rmd: Homepage for the website (will be replaced with the postcards page in the next step)\r\nNote that you can also choose to create a Distill website.\r\nThe difference between blog and website is explained in the introduction of the Distill package. Basically, a website is a collection of pages (be created with Distill Article) and a blog is a website with a special page called “listing page” to collect blog posts and display key metadata (such as publication date, author, title, categories, etc. in the YAML of a Rmarkdown file). In addition, using a Distill blog structure prevents re-rendering of each post when the site is rebuilt so that when certain R packages got updated, these post created with older version can still be displayed properly. On the other hand, using a Distill website structure, website pages and root pages of blogs are re-rendered when the site is rebuilt.\r\nRestart project and Build website\r\nRestart project so this project can be recognized as a website. Then use the Build Website to build the website locally.\r\n\r\nUse postcards to create a personal landing page\r\nCreate a Hugo Academic like homepage using the “trestles” template in postcards. Modify the content as see fit.\r\n\r\n\r\n# install.packages(\"postcards\")\r\ncreate_article(file = \"index\", template = \"trestles\", package = \"postcards\")\r\n\r\n# alternatively\r\npostcards::create_postcard(file = \"index.Rmd\", template = \"trestles\")\r\n\r\n\r\n\r\nCreate a personal blog theme if needed\r\n\r\n\r\n# apply the theme to entire website\r\ncreate_theme(\"theme\")\r\n\r\n\r\n Make sure to include customized theme in _site.yml so the effect will be applied to the entire website.\r\n\r\nDetail information on customizing the theme CSS file can be found under the Theming section of the Distill package website.\r\nCreate post\r\n\r\n\r\ncreate_post(title = \"First post\", \r\n            author = \"Ya-Feng Wen\", \r\n            date = Sys.Date())\r\n\r\n\r\nThis create a sub folder under **_posts** folder for each post.\r\nDeploy the site on GitHub\r\nPush all the update files to GitHub\r\nUnder Settings find the Pages on the left hand navigation bar. This will show the configuration for the GitHub Pages. Change the Source to /docs which contains all the necessary components for the website.\r\n\r\nCongratulations to have a personal website!\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-07-06T11:02:03-07:00",
    "input_file": {}
  }
]
